{
    // Enables or disables the debug log statements, which can be useful for troubleshooting issues.
    "debug": false,
    "gracePeriod": 180,
    "startDelay": 1,
    // This setting allows you to specify a preferred screen resolution that your application will always revert to when not overridden by other settings. 
    // The 'width' and 'height' fields specify the dimensions of the preferred resolution, and the 'refresh' field specifies the refresh rate.
    // Set 'enabled' to true if you wish to enable this feature. If 'enabled' is set to false, the application will ignore these values and use the default or previously set resolution.
    "preferredResolution": {
        "width": 1920,
        "height": 1080,
        "refresh": 60,
        "enabled": false
    },
    "overrides": [
        // recommended for steam deck users, uncomment to enable, but make sure you have 3840x2400 added on your host!
        // sunshine has issues downscaling to smaller resolutions, so it is recommended to stream above native (you will see a significant difference)
        // simply uncomment below line once done
        //"2560x1440x90=3840x2400x60",
    ],
    "force10BitDepthOnUnsupportedDevices": {
        // This setting attempts to enable 10-bit depth support on devices that can't support it natively, by halving the refresh rate.
        // Please note that this is only factored when HDR (High Dynamic Range) is enabled and the you are currently streaming with HDR enabled in Moonlight.
        // Be aware that this setting will typically lock the desktop at 30fps, but games that allow you to turn off VSYNC will not be impacted.
        // It is only recommended to turn this setting on if you have a dummy plug and would like to have 10-bit color depth while gaming.
        "enabled": false,
        "refreshRate": 30
    },
    "installationOrderPreferences": {
        "enabled": true,
        // Set the order which the scripts are installed in, if the scripts are currently out of order, they will be reinstalled in the order specified here.
        // All of these scripts are optional and will not impact your experience if they are not installed.
        // However, I am shamelessly plugging in links to the scripts here, so you can easily find them.
        "scriptNames": [
            "MonitorSwapper", // https://github.com/Nonary/MonitorSwapAutomation/releases/latest  (Swaps the primary monitor to a dummy plug and then back when finished.)
            "ResolutionMatcher", // https://github.com/Nonary/ResolutionAutomation/releases/latest (Automatically sets the resolution to the same as the client streaming.)
            "AutoHDR", // https://github.com/Nonary/AutoHDRSwitch/releases/latest (Automatically enables HDR if the client is streaming HDR content.)
            "RTSSLimiter", // https://github.com/Nonary/RTSSLimiter/releases/latest (Limits the host framerate to the client's streaming framerate to reduce microstuttering)
            "PlayNiteWatcher" // https://github.com/Nonary/PlayniteWatcher/releases/latest (Export any game with the box art in Playnite to the Moonlight client. Enables automatic stream termination and ability to close games from Moonlight.)
        ]
    }
}